<template>
  <client-only>
    <div class="popup_mask">
      <div class="popup_wrapper">
        <div class="popup_container">
          <div class="terms_popup_wrap">
            <div class="popup_wrap">
              <div class="popup_title">{{ title }}</div>
              <div class="popup_text_wrap">
                <div v-if="title === '이용약관'">
                  <h1>제 1장 총칙</h1>
                  <h2>제 1조 (목적)</h2>
                  <p>
                    이 약관은 띵커스주식회사(이하 ‘회사’라 합니다)와 이용 고객(이하 ‘회원’이라 합니다)간에 회사가 제공하는 오돜 서비스(이하 ‘오돜’ 또는 ‘서비스’라 합니다)의 가입조건 및
                    이용에 관한 제반 사항과 기타 필요한 사항을 구체적으로 규정함을 목적으로 합니다.
                  </p>
                  <h2>제 2조 (용어의 정리)</h2>
                  <p>① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
                  <p>- ‘회원’이라 함은 ‘오돜’에 개인정보를 제공하여 회원등록을 한 자로서, ‘오돜’의 정보를 지속적으로 제공받으며, ‘오돜’이 제공하는 서비스를 계속적으로 이용할 수 있는 자를
                    말합니다.</p>
                  <p>- '이용계약'이라 함은 이 약관을 포함하여 서비스 이용과 관련하여 회사와 회원 간에 체결하는 모든 계약을 말합니다.</p>
                  <p>- '회원아이디'라 함은 회원의 식별 및 서비스 이용을 위하여 회원의 신청에 따라 회사가 회원별로 부여하는 고유한 문자와 숫자의 조합을 말합니다.</p>
                  <p>- '비밀번호'라 함은 회원아이디로 식별되는 회원의 본인 여부를 검증하기 위하여 회원이 설정하여 회사에 등록한 고유의 문자와 숫자의 조합을 말합니다.</p>
                  <p>- '해지'라 함은 회원이 이용계약을 해약하는 것을 말합니다.</p>
                  <p>② 이 약관에서 사용하는 용어 중 제1항에서 정하지 아니한 것은 관계 법령 및 서비스별 안내에서 정하는 바에 따르며, 그 외에는 일반 관례에 따릅니다.</p>
                  <p>③ 이 약관에 동의하는 것은 정기적으로 사이트를 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못해 발생하는 이용자의 피해는
                    회사에서 책임지지 않습니다.</p>
                  <p>④ 회원은 변경된 약관에 동의하지 않을 경우 회원 탈퇴(해지)를 요청할 수 있으며, 변경된 약관의 효력 발생일로부터 7일 이후에도 거부 의사를 표시하지 아니하고 서비스를 계속
                    사용할 경우 약관의 변경 사항에 동의한 것으로 간주됩니다.</p>
                  <h2>제 3조(이용약관의 효력 및 변경)</h2>
                  <p>① 이 약관은 오돜에서 온라인으로 공시함으로써 효력을 발생하며, 합리적인 사유가 발생할 경우 관련법령에 위배되지 않는 범위 안에서 개정될 수 있습니다. 개정된 약관은 온라인에서
                    공지함으로써 효력을 발휘하며, 이용자의 권리 또는 의무 등 중요한 규정의 개정은 사전에 공지합니다.</p>
                  <p>② 이 약관에 동의하는 것은 정기적으로 사이트를 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못해 발생하는 이용자의 피해는
                    회사에서 책임지지 않습니다.</p>
                  <p>③ 회원은 변경된 약관에 동의하지 않을 경우 회원 탈퇴(해지)를 요청할 수 있으며, 변경된 약관의 효력 발생일로부터 7일 이후에도 거부의사를 표시하지 아니하고 서비스를 계속
                    사용할 경우 약관의 변경 사항에 동의한 것으로 간주됩니다.</p>
                  <h2>제 4조(약관외 준칙)</h2>
                  <p>① 이 약관은 회사가 제공하는 개별서비스에 관한 이용안내와 함께 적용합니다.</p>
                  <p>② 이 약관에 명시되지 아니한 사항에 대해서는 관계법령 및 이용안내의 취지에 따라 적용할 수 있습니다.</p>
                  <p>③ 이 약관에 동의하는 것은 정기적으로 사이트를 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못해 발생하는 이용자의 피해는
                    회사에서 책임지지 않습니다.</p>
                  <h1>제 2장 이용계약 체결</h1>
                  <h2>제 5조(이용계약의 성립)</h2>
                  <p>① 이용계약은 이용자의 이용계약 내용에 대한 동의와 이용신청에 대하여 회사의 이용승낙으로 성립합니다.</p>
                  <p>② 이용계약에 대한 동의는 이용신청 시 이용약관을 읽고 '동의함' 체크박스에 체크를 한 후 ‘회원가입’ 버튼을 누름으로써 동의하는 것으로 간주됩니다.</p>
                  <h2>제 6조(서비스 이용 신청)</h2>
                  <p>① 회원으로 가입하여 서비스를 이용하고자 하는 이용자는 회사에서 요청하는 제반 정보(이름, 생년, 성별, 회원아이디, 비밀번호, 필명, 학교, 입학년도, 주소, 전자우편주소, 휴대전화번호 등)를 제공하여야 합니다.</p>
                  <p>② 모든 회원은 반드시 회원 본인의 정보를 제공하여야만 서비스를 이용할 수 있으며, 타인의 정보를 도용하거나 허위의 정보를 등록하는 등 본인의 진정한 정보를 등록하지 않은 회원은 서비스 이용과 관련하여 아무런 권리를 주장할 수 없으며, 관계 법령에 따라 처벌받을 수 있습니다.</p>
                  <p>③ 타인의 명의(이름 및 주민등록번호)를 도용하여 이용신청을 한 회원의 모든 아이디는 삭제되며, 관계법령에 따라 처벌을 받을 수 있습니다.</p>
                  <h2>제 7조(개인정보의 보호 및 사용)</h2>
                  <p>① 회사는 관계법령이 정하는 바에 따라 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련 법령 및 회사의 개인정보 취급방침이 적용됩니다. 단, 회사의 공식 사이트 이외의 웹에서 링크된 사이트에서는 회사의 개인정보 취급방침이 적용되지 않습니다. 또한, 회원은 비밀번호 등이 타인에게 노출되지 않도록 철저히 관리해야 하며 회사는 회원의 귀책사유로 인해 노출된 정보에 대해서 일체의 책임을 지지 않습니다.</p>
                  <p>② 회사는 다음과 같은 경우에 법이 허용하는 범위 내에서 회원의 개인정보를 제3자에게 제공할 수 있습니다.</p>
                  <p>- 수사기관이나 기타 정부기관으로부터 정보제공을 요청 받은 경우</p>
                  <p>- 회원의 법령 또는 약관의 위반을 포함하여 부정행위 확인 등의 정보보호 업무를 위해 필요한 경우</p>
                  <p>- 기타 법률에 의해 요구되는 경우</p>
                  <p>③ 타인의 명의(이름 및 주민등록번호)를 도용하여 이용신청을 한 회원의 모든 아이디는 삭제되며, 관계법령에 따라 처벌을 받을 수 있습니다.</p>
                  <h2>제 8조(이용 신청의 승낙과 제한)</h2>
                  <p>① 회사는 제5조, 제6조의 규정에 의한 이용신청에 대하여 업무 수행상 또는 기술상 지장이 없는 경우에 원칙적으로 접수순서에 따라 서비스 이용을 승낙합니다.</p>
                  <p>② 회사는 아래사항에 해당하는 경우에 대해서 승낙을 보류할 수 있습니다.</p>
                  <p>- 실명이 아니거나 타인의 명의를 이용하여 신청한 경우</p>
                  <p>- 이용계약 신청서의 내용을 허위로 기재한 경우</p>
                  <p>- 법령 위반 또는 사회의 안녕과 질서, 미풍양속을 저해할 목적으로 신청한 경우</p>
                  <p>- 부정한 용도로 본 서비스를 이용하고자 하는 경우</p>
                  <p>- 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우</p>
                  <p>- 서비스와 경쟁관계에 있는 이용자가 신청하는 경우</p>
                  <p>- 법령 또는 약관을 위반하여 이용계약이 해지된 적이 있는 이용자가 신청하는 경우</p>
                  <p>- 기타 규정한 제반 사항을 위반하며 신청하는 경우</p>
                  <p>③ 회사는 서비스 이용신청이 다음 각 호에 해당하는 경우에는 그 신청에 대하여 승낙 제한사유가 해소될 때까지 승낙을 유보할 수 있습니다.</p>
                  <p>- 회사가 설비의 여유가 없는 경우</p>
                  <p>- 회사의 기술상 지장이 있는 경우</p>
                  <p>- 기타 회사의 귀책사유로 이용승낙이 곤란한 경우</p>
                  <p>④ 회사는 이용신청고객이 만 14세 미만일 경우에 이용안내에서 정하는 바에 따라 승낙을 보류할 수 있습니다.</p>
                  <p>⑤ 회사는 회원가입 절차완료 이후 제2항 각 호에 따른 사유가 발견된 경우 이용 승낙을 철회할 수 있습니다.</p>
                  <h2>제 9조(회원의 아이디 부쳐 및 변경 등)</h2>
                  <p>① 회사는 회원에 대하여 약관에 정하는 바에 따라 회원아이디를 부여합니다.</p>
                  <p>② 회원아이디는 원칙적으로 변경이 불가하며 부득이한 사유로 인하여 변경하고자 하는 경우에는 해당 아이디를 해지하고 재가입해야 합니다.</p>
                  <p>③ 오돜의 회원아이디는 회원 본인의 동의 하에 회사가 운영하는 사이트의 회원ID와 연결될 수 있습니다.</p>
                  <p>④ 회원아이디는 다음 각 호에 해당하는 경우에는 회원의 요청 또는 회사의 직권으로 변경 또는 이용을 정지할 수 있습니다.</p>
                  <p>- 회원아이디가 전화번호 또는 주민등록번호 등으로 등록되어 사생활 침해가 우려되는 경우</p>
                  <p>- 타인에게 혐오감을 주거나 미풍양속에 어긋나는 경우</p>
                  <p>- 회사, 회사의 서비스 또는 서비스 운영자 등의 명칭과 동일하거나 오인 등의 우려가 있는 경우</p>
                  <p>- 기타 합리적인 사유가 있는 경우</p>
                  <p>⑤ 회원아이디 및 비밀번호의 관리책임은 회원에게 있습니다. 이를 소홀이 관리하여 발생하는 서비스 이용상의 손해 또는 제3자에 의한 부정이용 등에 대한 책임은 회원에게 있으며 회사는 그에 대한 책임을 지지 않습니다.</p>
                  <p>⑥ 기타 회원 개인정보 관리 및 변경 등에 관한 사항은 이용안내에 정하는 바에 의합니다.</p>
                  <h2>제 10조(회사의 의무)</h2>
                  <p>① 회사는 회원이 희망한 서비스 제공 개시일에 특별한 사정이 없는 한 서비스를 이용할 수 있도록 하여야 합니다.</p>
                  <p>② 회사는 계속적이고 안정적인 서비스의 제공을 위하여 설비에 장애가 생기거나 멸실된 때에는 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구합니다.</p>
                  <p>③ 회사는 개인정보 보호를 위해 보안시스템을 구축하며 개인정보 취급방침을 공시하고 준수합니다.</p>
                  <p>④ 회사는 회원으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 적절한 절차를 거쳐 즉시 처리하여야 합니다. 다만, 즉시 처리가 곤란한 경우는 회원에게 그 사유와 처리일정을 통보하여야 합니다.</p>
                  <h2>제 11조(회원의 의무)</h2>
                  <p>① 회원은 회원가입 신청 또는 회원정보 변경 시 모든 사항을 사실과 실명(회사의 요청 시)에 근거하여 작성하여야 하며, 허위 또는 타인의 정보를 등록할 경우 이와 관련된 모든 권리를 주장할 수 없습니다.</p>
                  <p>② 회원은 본 약관에서 규정하는 사항과 기타 회사가 정한 제반 규정, 공지사항 등 회사가 공지하는 사항 및 관계 법령을 준수하여야 하며, 기타 회사의 업무에 방해가 되는 행위, 회사의 명예를 손상시키는 행위, 타인에게 피해를 주는 행위를 해서는 안됩니다.</p>
                  <p>③ 회원은 주소, 연락처, 전자우편 주소 등 이용계약사항이 변경된 경우에 해당 절차를 거쳐 이를 회사에 즉시 알려야 합니다.</p>
                  <p>④ 회사가 관계법령 및 '개인정보 취급방침'에 의거하여 그 책임을 지는 경우를 제외하고 회원에게 부여된 아이디의 비밀번호 관리소홀, 부정사용에 의하여 발생하는 모든 결과에 대한 책임은 회원에게 있습니다.</p>
                  <p>⑤ 회원은 회사의 사전 승낙 없이 서비스를 이용하여 영업활동을 할 수 없으며, 그 영업활동의 결과에 대해 회사는 책임을 지지 않습니다. 또한 회원은 이와 같은 영업활동으로 회사가 손해를 입은 경우, 회원은 회사에 대해 손해배상의무를 지며, 회사는 해당 회원에 대해 서비스 이용제한 및 적법한 절차를 거쳐 손해배상 등을 청구할 수 있습니다.</p>
                  <p>⑥ 회원은 회사의 명시적 동의가 없는 한 서비스의 이용권한, 기타 이용계약상의 지위를 타인에게 양도, 증여할 수 없으며 이를 담보로 제공할 수 없습니다.</p>
                  <p>⑦ 회원은 회사 및 제3자의 지적 재산권을 포함한 제반 권리를 침해하거나 제18조 각 호에 해당하는 행위를 해서는 안되며, 해당 행위를 하는 경우에 회사는 회원의 서비스 이용제한 및 적법 조치를 포함한 제재를 가할 수 있습니다.</p>
                </div>
                <div v-if="title === '개인정보 취급방침'">
                  <h1>'띵커스주식회사'는 (이하 '회사')는</h1>
                  <p>고객님의 개인정보를 중요시하며, 정보통신망 이용촉진 및 정보보호에 관한 법률을 준수하고 있습니다.
                    회사는 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보 보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.
                    회사는 개인정보취급방침을 개정하는 경우 오돜 공지사항(또는 개별공지)을 통하여 공지할 것입니다.</p>
                  <h2>1. 수집하는 개인정보 항목</h2>
                  <p>
                    회사는 회원 가입, 고객 상담, 서비스의 제공 등을 위해 아래와 같은 개인정보를 수집하고 있습니다.
                  </p>
                  <h3>1) 수집항목</h3>
                  <p>- 필수항목 : 이름, 생년, 성별, 아이디, 비밀번호, 필명, 주소, 전자우편주소, 휴대전화번호</p>
                  <p>- 선택항목 : 학교, 입학년도, 정보수신여부(이메일, SMS)</p>
                  <p>- 자동수집항목 : 접속 로그, 쿠키, 접속 IP 정보, 서비스 이용 기록 등</p>
                  <h3>2) 개인정보 수집방법</h3>
                  <p>- 홈페이지를 통한 회원 가입 시, 이벤트 응모</p>
                  <h2>2. 개인정보의 수집 및 이용목적</h2>
                  <p>회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.</p>
                  <p>- 서비스 이용에 따른 민원사항의 처리를 위한 본인 식별, 신용평가기관을 통한 실명 확인, 중복가입 확인, 연령제한 서비스의 제공, 고객센터의 운영, 계정도용 및 부정이용 방지를 위하여 사용됩니다.</p>
                  <p>- 약관 개정 등의 고지사항 전달, 본인 의사 확인, 불만 처리 등 의사소통 경로의 확보, 새로운 서비스나 이벤트 정보 등 최신정보 안내 등을 위하여 사용됩니다.</p>
                  <p>- 콘텐츠 등 기존 서비스 제공(광고 포함)에 더하여, 인구통계학적 분석, 서비스 방문 및 이용기록의 분석, 개인정보 및 관심에 기반한 이용자간 관계의 형성, 지인 및 관심사 등에 기반한 맞춤형 서비스 제공 등 신규 서비스 요소의 발굴 및 기존 서비스 개선 등을 위하여 사용됩니다.</p>
                  <p>- 상품 및 서비스의 배송을 위하여 사용됩니다.</p>
                  <p>- 이벤트 정보 및 참여기회 제공, 광고성 정보 제공 등 마케팅 및 프로모션 목적으로 사용됩니다.</p>
                  <p>- 서비스 이용기록과 접속 빈도 분석, 서비스 이용에 대한 통계, 서비스 분석 및 통계에 따른 맞춤 서비스 제공 및 광고 게재 등에 사용됩니다.</p>
                  <p>- 보안, 프라이버시, 안전 측면에서 이용자가 안심하고 이용할 수 있는 서비스 이용환경 구축을 위해 사용됩니다.</p>
                  <h2>3. 개인정보의 보유 및 이용기간</h2>
                  <p>회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.</p>
                  <p>* 보존 항목 : 이름, 회원아이디, 생년, 성별, 주소(상세주소 제외)</p>
                  <p>* 보존 근거 : 불량이용 재발방지 및 수사기관 협조</p>
                  <p>* 보존 기간 : 1년</p>
                  <p>그리고 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 아래와 같이 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다.</p>
                  <p>* 보존 항목 : 서비스 이용기록, 접속 로그, 접속 IP 정보</p>
                  <p>* 보존 근거 : 통신비밀보호법</p>
                  <p>* 보존 기간 : 3개월</p>
                  <p>* 표시/광고에 관한 기록 : 6개월 (전자상거래등에서의 소비자보호에 관한 법률)</p>
                  <p>* 또는 청약철회 등에 관한 기록 : 5년 (전자상거래등에서의 소비자보호에 관한 법률)</p>
                  <p>* 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년 (전자상거래등에서의 소비자보호에 관한 법률)</p>
                  <h2>4. 개인정보의 파기절차 및 방법</h2>
                  <p>회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.</p>
                  <h3>1) 파기절차</h3>
                  <p>회원님이 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다.
                    별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니면 보유하는 항목 이외의 다른 목적으로 이용되지 않습니다.</p>
                  <h3>2) 파기방법</h3>
                  <p>전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.</p>
                  <h2>5. 개인정보 제3자 제공</h2>
                  <p>회사는 개인정보를 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3의 업체에게 제공할 것입니다.
                    제3의 업체에게 개인정보를 제공하는 경우, 개인정보를 제공받은 업체이름, 개인정보 이용목적, 제공하는 개인정보 항목, 제공받는 자의 보유 및 이용기간 등을 본 문서에 공지할 것입니다.
                    또한 제3의 업체에게 개인정보를 제공할 경우에도 최소한의 정보만을 안전한 방법으로 전달, 관리할 것입니다.</p>
                  <h2>6. 이용자의 권리와 행사방법</h2>
                  <p>이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.
                    이용자의 개인정보 조회, 수정을 위해서는 ‘회원정보변경’을, 가입해지(동의철회)를 위해서는 ‘회원정보변경>MY 회원정보>회원탈퇴’를 클릭하여 본인확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다.
                    혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체없이 조치합니다.</p>
                  <p>귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록 합니다.
                    회사는 이용자의 요청에 의해 해지 또는 삭제된 개인정보는 회사가 수집하는 개인정보의 보유 및 이용기간에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.</p>
                  <h2>7. 개인정보에 관한 민원서비스</h2>
                  <p>회사는 고객의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고 있습니다.</p>
                  <p>개인정보관리책임자 : 심재운</p>
                  <p>전화번호 : 010-4377-2772</p>
                  <p>이메일 : sjw7998@naverm.com</p>
                  <p>귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.
                    기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.</p>
                  <p>- 개인분쟁조정위원회 (www.1336.or.kr, 국번없이 1336)</p>
                  <p>- 정보보호마크인증위원회 (www.eprivacy.or.kr, 02-580-0533~4)</p>
                  <p>- 대검찰청 인터넷범죄수사센터 (icic.sppo.go.kr, 02-3480-3600)</p>
                  <p>- 경찰청 사이버테러대응센터 (www.ctrc.go.kr, 02-392-0330)</p>
                  <h1>본 개인정보 취급방침은 2022년 12월 26일부터 적용됩니다.</h1>
                </div>
              </div>
            </div>
            <div class="popup_btn_wrap">
              <button @click="ok">확인</button>
            </div>
          </div>
        </div>


      </div>
    </div>
  </client-only>
</template>

<script>
import Vue from 'vue';
import PopupMixin from '@/mixins/popupMixin';

export default Vue.extend({
  mixins: [PopupMixin],
  methods: {},
});
</script>
